{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|UNK|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|CLS|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|SEP|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|PAD|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<|MASK|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<|SOS|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<|EOS|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Whitespace"
      },
      {
        "type": "BertPreTokenizer"
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<|UNK|>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|UNK|>": 0,
      "<|CLS|>": 1,
      "<|SEP|>": 2,
      "<|PAD|>": 3,
      "<|MASK|>": 4,
      "<|SOS|>": 5,
      "<|EOS|>": 6,
      ".": 7,
      "C": 8,
      "F": 9,
      "U": 10,
      "a": 11,
      "b": 12,
      "c": 13,
      "d": 14,
      "e": 15,
      "f": 16,
      "g": 17,
      "h": 18,
      "i": 19,
      "l": 20,
      "m": 21,
      "n": 22,
      "o": 23,
      "p": 24,
      "r": 25,
      "s": 26,
      "t": 27,
      "u": 28,
      "v": 29,
      "w": 30,
      "y": 31,
      "in": 32,
      "en": 33,
      "th": 34,
      "de": 35,
      "the": 36,
      "Us": 37,
      "at": 38,
      "ain": 39,
      "er": 40,
      "main": 41,
      "on": 42,
      "Use": 43,
      "ce": 44,
      "ide": 45,
      "of": 46,
      "or": 47,
      "pi": 48,
      "pp": 49,
      "su": 50,
      "sen": 51,
      "ta": 52,
      "to": 53,
      "ten": 54,
      "ing": 55,
      "idea": 56,
      "ort": 57,
      "pport": 58,
      "support": 59,
      "senten": 60,
      "sentence": 61
    },
    "merges": [
      "i n",
      "e n",
      "t h",
      "d e",
      "th e",
      "U s",
      "a t",
      "a in",
      "e r",
      "m ain",
      "o n",
      "Us e",
      "c e",
      "i de",
      "o f",
      "o r",
      "p i",
      "p p",
      "s u",
      "s en",
      "t a",
      "t o",
      "t en",
      "in g",
      "ide a",
      "or t",
      "pp ort",
      "su pport",
      "sen ten",
      "senten ce"
    ]
  }
}